Revit 2024 API
WorksetPreview.UniqueId Property
 UniqueId of the workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Guid UniqueId { get; }
Visual Basic
Public ReadOnly Property UniqueId As Guid
	Get
Visual C++
public:
property Guid UniqueId {
	Guid get ();
}
Remarks
 Stable identifier for a workset, UniqueId will not change while synchronizing with central.
See Also
WorksetPreview Class
Autodesk.Revit.DB Namespace